DeviceEvents
| where ActionType == "TamperingAttempt"
| extend Target = tostring(AdditionalFields.Target)
| extend Result = tostring(AdditionalFields.Status)
| extend TamperingAction = tostring(AdditionalFields.TamperingAction)
| project TimeGenerated, DeviceName, InitiatingProcessAccountName, InitiatingProcessParentFileName, InitiatingProcessFileName, Target, Result, TamperingAction
