DeviceFileEvents
| where ActionType == "FileCreated"
| where FolderPath matches regex @"(?i).:\\Users\\Public\\.*" or FolderPath matches regex @"(?i).:\\ProgramFiles\\.*" or FolderPath matches regex @"(?i).:\\Users\\Admin\\.*"
| where FileName has_any (".bat", ".ps1", ".js", ".dll", ".exe", ".msi", ".save")
| project TimeGenerated, ActionType, DeviceName, InitiatingProcessAccountName, InitiatingProcessAccountUpn, InitiatingProcessVersionInfoFileDescription, InitiatingProcessCommandLine, InitiatingProcessFileName,InitiatingProcessFolderPath, FileMD5 = MD5, FileName, FolderPath

// https://www.volexity.com/blog/2024/11/22/the-nearest-neighbor-attack-how-a-russian-apt-weaponized-nearby-wi-fi-networks-for-covert-access/
// https://thedfirreport.com/2024/12/02/the-curious-case-of-an-egg-cellent-resume/
