DeviceProcessEvents 
| where ProcessVersionInfoOriginalFileName == "bcdedit.exe"
| where ProcessCommandLine contains "set"
| where ProcessCommandLine has_any ("recoveryenabled", "no", "bootstatuspolicy", "ignoreallfailures")
