DeviceProcessEvents
| where ProcessVersionInfoOriginalFileName =~ "Schtasks.exe"
| where ProcessCommandLine has_all ("/XML", ".txt")
| project TimeGenerated, AccountName, AccountUpn, ActionType, DeviceName, InitiatingProcessVersionInfoOriginalFileName, FileName, ProcessCommandLine

// https://thedfirreport.com/2024/12/02/the-curious-case-of-an-egg-cellent-resume/
