DeviceProcessEvents
| where AccountName !in~ ("root", "system")
| where InitiatingProcessFileName in~("cmd.exe", "powershell.exe")
| where ProcessCommandLine has_any ("arp", "whoami", "netstat", "nslookup", "nltest", "domain", "tasklist", "net", "route", "tzlist" "time", "tracert", "ping", "wmic", "admin$", "c$", "taskkill", "echo", "srvany", "instsrv")
| summarize Count = dcount(FileName), Files = make_set(FileName), Commands = make_set(ProcessCommandLine) by AccountName, DeviceName, InitiatingProcessFileName
| where Count >= 3
| sort by Count
