DeviceProcessEvents
| where FileName == "schtasks.exe"
| where ProcessCommandLine has_any ("system", "rundll", "onstart")
| where InitiatingProcessFileName in ("cmd.exe", "powershell.exe", "explorer.exe")
// Possible MustangPanda IOC 
