DeviceProcessEvents 
| where FileName =~ "bcdedit.exe"
| where ProcessCommandLine contains "set"
| where ProcessCommandLine has_any ("recoveryenabled", "no", "bootstatuspolicy", "ignoreallfailures") 
