DeviceProcessEvents
| where (InitiatingProcessFolderPath endswith @'\onenote.exe' and 
((FileName in~ (@'RUNDLL32.exe', @'REGSVR32.exe', @'bitsadmin.exe', @'CertUtil.exe', @'InstallUtil.exe', @'schtasks.exe', @'wmic.exe', @'cscript.exe', @'wscript.exe', @'CMSTP.EXE', @'Microsoft.Workflow.Compiler.exe', @'RegAsm.exe', @'RegSvcs.exe', @'MSHTA.EXE', @'Msxsl.exe', @'IEExec.exe', @'Cmd.Exe', @'PowerShell.EXE', @'HH.exe', @'javaw.exe', @'pcalua.exe', @'curl.exe', @'ScriptRunner.exe', @'CertOC.exe', @'WorkFolders.exe', @'odbcconf.exe', @'msiexec.exe', @'msdt.exe') or (FolderPath endswith @'\rundll32.exe' or FolderPath endswith @'\regsvr32.exe' or FolderPath endswith @'\bitsadmin.exe' or FolderPath endswith @'\certutil.exe' or FolderPath endswith @'\installutil.exe' or FolderPath endswith @'\schtasks.exe' or FolderPath endswith @'\wmic.exe' or FolderPath endswith @'\cscript.exe' or FolderPath endswith @'\wscript.exe' or FolderPath endswith @'\cmstp.exe' or FolderPath endswith @'\Microsoft.Workflow.Compiler.exe' or FolderPath endswith @'\regasm.exe' or FolderPath endswith @'\regsvcs.exe' or FolderPath endswith @'\mshta.exe' or FolderPath endswith @'\msxsl.exe' or FolderPath endswith @'\ieexec.exe' or FolderPath endswith @'\cmd.exe' or FolderPath endswith @'\powershell.exe' or FolderPath endswith @'\hh.exe' or FolderPath endswith @'\javaw.exe' or FolderPath endswith @'\pcalua.exe' or FolderPath endswith @'\curl.exe' or FolderPath endswith @'\scriptrunner.exe' or FolderPath endswith @'\certoc.exe' or FolderPath endswith @'\workfolders.exe' or FolderPath endswith @'\odbcconf.exe' or FolderPath endswith @'\msiexec.exe' or FolderPath endswith @'\msdt.exe')) or (FolderPath endswith @'\explorer.exe' and (ProcessCommandLine contains @'.hta' or ProcessCommandLine contains @'.vb' or ProcessCommandLine contains @'.wsh' or ProcessCommandLine contains @'.js' or ProcessCommandLine contains @'.ps' or ProcessCommandLine contains @'.scr' or ProcessCommandLine contains @'.pif' or ProcessCommandLine contains @'.bat' or ProcessCommandLine contains @'.cmd')) or (FolderPath contains @'\AppData\' or FolderPath contains @'\Users\Public\' or FolderPath contains @'\ProgramData\' or FolderPath contains @'\Windows\Tasks\' or FolderPath contains @'\Windows\Temp\' or FolderPath contains @'\Windows\System32\Tasks\')))
| where ProcessCommandLine <> "Teams.exe -Embedding" // Filters out expected activity

// This can be edited really to look for any childprocess of a program you might be interested in
