DeviceProcessEvents
| where InitiatingProcessVersionInfoOriginalFileName in ((
    externaldata ( Name:string ) [ "https://lolbas-project.github.io/api/lolbas.csv" ]
    with (format=csv, ignoreFirstRecord=true) 
))
| project InitiatingProcessVersionInfoOriginalFileName

// Extracts the CSV list of Living off the land binaries scripts and libraries from https://lolbas-project.github.io
