let EmailLimit = 100;
EmailEvents
| where TimeGenerated > ago(1h)
| where EmailDirection == "Inbound"
| where DeliveryAction == "Delivered"
| summarize EmailCount = count() by RecipientEmailAddress, SenderFromAddress
| where EmailCount > EmailLimit

// From Kevin Beaumonts research on new Ransomware techniques
  https://www.microsoft.com/en-us/security/blog/2024/05/15/threat-actors-misusing-quick-assist-in-social-engineering-attacks-leading-to-ransomware/
